resources/templates/adcapis/GetCustomerInfo.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <Authentication xmlns="http://www.alarm.com/WebServices">
      <User>#ALARM_USER#</User>
      <Password>#ALARM_PASS#</Password>
      <TwoFactorDeviceId>string</TwoFactorDeviceId>
    </Authentication>
  </soap:Header>
  <soap:Body>
       <GetCustomerInfo_V2 xmlns="http://www.alarm.com/WebServices">
      <input>
        <CallerVersion>1111</CallerVersion>
        <CustomerId>#CUSTOMER_ID#</CustomerId>
      </input>
    </GetCustomerInfo_V2>
  </soap:Body>
</soap:Envelope>